#include <iostream>
#include <cstdlib>
using namespace std;
int main()
 { 
  //_beep定義在stdlib.h內，發出某個音頻聲，幾秒鐘
  //例 _beep(392,500);發出Sol音,0.5(=500/1000)秒鐘
  _beep(392,500); //533 422 1234555
  _beep(330,500);
  _beep(330,1000);

  _beep(349,500);
  _beep(293,500);
  _beep(293,1000);

  _beep(263,500);
  _beep(293,500);
  _beep(330,500);
  _beep(349,500);
  _beep(392,500);
  _beep(392,500);
  _beep(392,1000);

  _beep(392,500);//533 422 13553
  _beep(330,500);
  _beep(330,1000);

  _beep(349,500);
  _beep(293,500);
  _beep(293,1000);

  _beep(263,500);
  _beep(330,500);
  _beep(392,500);
  _beep(392,500);
  _beep(330,2000);

  _beep(293,500);//2222234
  _beep(293,500);
  _beep(293,500);
  _beep(293,500);
  _beep(293,500);
  _beep(330,500);
  _beep(349,1000);

  _beep(330,500);//3333345
  _beep(330,500);
  _beep(330,500);
  _beep(330,500);
  _beep(330,500);
  _beep(349,500);
  _beep(392,1000);

  _beep(392,500);//533 422 13551
  _beep(330,500);
  _beep(330,1000);

  _beep(349,500);
  _beep(293,500);
  _beep(293,1000);

  _beep(263,500);
  _beep(330,500);
  _beep(392,500);
  _beep(392,500);
  _beep(263,1000);
    
  system("PAUSE");	
  return 0;
 }
