#include <iostream>
#include <cstdlib>
#include <cstring>
#include <ctime>
using namespace std;
int main()
 { 
  int i;
  int bmp;
  clock_t start_clock,end_clock;
  float spend;  //小綠人已行走的時間(秒)
  
  //使用2維字串陣列記錄圖案   
  string green_walker[11][16]={
            
   //bmp:0 第1張靜止紅綠燈之小綠人
   { "      111        ",
     "      111        ",
     "      111        ",
     "      1 1        ",
     "     11111       ",     
     "    1111111      ",
     "    1111111      ",
     "    1 111 1      ",
     "    1 111 1      ",
     "    1 111 1      ",
     "    1111111      ",
     "     11111       ",
     "     11 11       ",
     "     11 11       ",
     "     11 11       ",
     "    111 111      "},  

   //bmp:1 第2張紅綠燈之小綠人
   { "                 ",
     "     11          ",
     "    1111         ",
     "     11          ",
     "      11         ",
     "      1111       ",
     "      111 1      ",
     "     1 11  1     ",
     "    1  11  1     ",
     "       111       ",
     "       1 1       ",
     "      1   111    ",
     "      1      1   ",
     "      1     1    ",
     "    11           ",
     "                 "}, 

   //bmp:2 第3張紅綠燈之小綠人
   { "                 ",
     "    11           ",
     "   1111          ",
     "    11           ",
     "     11          ",
     "     111         ",
     "     11 1        ",
     "    1111 1       ",
     "   1  11 1       ",
     "      111        ",
     "      1 1        ",
     "     1   11      ",
     "    1     1      ",
     "     11  11      ",
     "      1          ",
     "    111          "},

   //bmp:3 第4張紅綠燈之小綠人 
   { "                 ",
     "     11          ",
     "    1111         ",
     "     11          ",
     "      11         ",
     "      111        ",
     "      1111       ",
     "      111 1      ",
     "       11 1      ",
     "       111       ",
     "       1 1       ",
     "      1   1      ",
     "      1    1     ",
     "      1     1    ",
     "    111      1   ",
     "            1    "},

   //bmp:4 第5張紅綠燈之小綠人 
   { "                 ",
     "    11           ",
     "   1111          ",
     "    11           ",
     "     11          ",
     "     1111        ",
     "     111 1       ",
     "    1 11 1       ",
     "   1  11         ",
     "      111        ",
     "      1 1        ",
     "     1   11      ",
     "     1     11    ",
     "     1      1    ",
     "   11      1     ",
     "                 "},

   //bmp:5 第6張紅綠燈之小綠人 
   { "                 ",
     "     11          ",
     "    1111         ",
     "     11          ",
     "      11         ",
     "      111        ",
     "      111        ",
     "      111        ",
     "       11        ",
     "       11        ",
     "       11        ",
     "       11        ",
     "        1        ",
     "        1        ",
     "        1        ",
     "      111        "}, 

   //bmp:6 第7張紅綠燈之小綠人 
   { "                 ",
     "    11           ",
     "   1111          ",
     "    11           ",
     "     11          ",
     "     1111        ",
     "     111 1       ",
     "     111  1      ",
     "    1 11         ",
     "      111        ",
     "      1 1        ",
     "     1   111     ",
     "     1      1    ",
     "   111           ",
     "                 ",
     "                 "}, 

   //bmp:7 第8張紅綠燈之小綠人 
   { "                 ",
     "     11          ",
     "    1111         ",
     "     11          ",
     "      11         ",
     "      111        ",
     "      11 1       ",
     "      1111       ",
     "       111       ",
     "       11        ",
     "       11        ",
     "      111        ",
     "      1  1       ",
     "       1  1      ",
     "     111   1     ",
     "                 "}, 

   //bmp:8 第9張紅綠燈之小綠人 
   { "                 ",
     "    11           ",
     "   1111          ",
     "    11           ",
     "     11          ",
     "     1111        ",
     "     111 1       ",
     "    1 11  1      ",
     "   1  11  1      ",
     "      11         ",
     "      111        ",
     "      1 1        ",
     "     1   11      ",
     "     1    11     ",
     "     1     1     ",
     "   11     1     "}, 

   //bmp:9 第1 張紅綠燈之小綠人 
   { "                 ",
     "     11          ",
     "    1111         ",
     "     11          ",
     "      11         ",
     "      111        ",
     "      11 1       ",
     "     1111 1      ",
     "    1  11 1      ",
     "       111       ",
     "       1 1       ",
     "      1   1      ",
     "     1     1     ",
     "      11    1    ",
     "       1   11    ",
     "      11         "}     
   };


  //顯示第0張圖      
  for (i=0;i<16;i++)
   {
    cout << green_walker[0][i] ;//顯示第0張圖的第i列      
    cout << '\n' ;        
   }
   
  _sleep(1000); //暫停或延遲1(=1000/1000) 秒鐘 
  
  start_clock=clock();
  //取得程式從目前執行到此函數
  //所經過的滴答數(ticks)
   
  while (1)
   {   
    for (bmp=1;bmp<=9;bmp++)
     {
      system("CLS");       
      //顯示第bmp張圖         
      for (i=0;i<16;i++)
       {         
        cout << green_walker[bmp][i];//顯示第bmp張圖的第i列      
        cout << '\n' ;        
       }
           
      end_clock=clock();
      //取得程式從開始執行到此函數
      //所經過的滴答數(ticks)
       
      spend =(double) (end_clock-start_clock)/CLK_TCK;
      //從小綠人開始執行到目前所經過的時間(秒) 
     
      if (spend<=30)      //慢走(第0~30秒),每0.65秒播一張圖案 
         _sleep(650);   
      else if (spend<=45) //快走(第30~45秒),每0.325秒播一張圖案 
         _sleep(325);
      else if (spend<=60) //跑走(第45~60秒),每0.125秒播一張圖案 
         _sleep(125);
      else
        break;
     }
    if (spend>=60)  //一分鐘後  
      break;  
   }
  
  system("CLS");
  //顯示第0張圖     
  for (i=0;i<16;i++)
   {
    cout << green_walker[0][i];//顯示第0張圖的第i列
    cout << '\n' ;        
   }  
  //顯示第0張圖 
   
  system("PAUSE");	
  return 0;
 }
